'''Задача-2: Запросите от пользователя число, сохраните в переменную, прибавьте
к числу 2 и выведите результат на экран. Если возникла ошибка, прочитайте её,
вспомните урок и постарайтесь устранить ошибку.'''


user_number = int(input('Введите число: '))
print(f'Результат: {user_number + 2}')
