'''Задача - 2: Вам дан текст:'''

some_str = '''
Мороз и солнце; день чудесный!
Еще ты дремлешь, друг прелестный —
Пора, красавица, проснись:
Открой сомкнуты негой взоры
Навстречу северной Авроры,
Звездою севера явись!
Вечор, ты помнишь, вьюга злилась,
На мутном небе мгла носилась;
Луна, как бледное пятно,
Сквозь тучи мрачные желтела,
И ты печальная сидела —
А нынче... погляди в окно:
Под голубыми небесами
Великолепными коврами,
Блестя на солнце, снег лежит;
Прозрачный лес один чернеет,
И ель сквозь иней зеленеет,
И речка подо льдом блестит.
Вся комната янтарным блеском
Озарена. Веселым треском
Трещит затопленная печь.
Приятно думать у лежанки.
Но знаешь: не велеть ли в санки
Кобылку бурую запречь?
Скользя по утреннему снегу,
Друг милый, предадимся бегу
Нетерпеливого коня
И навестим поля пустые,
Леса, недавно столь густые,
И берег, милый для меня.
'''

'''Необходимо с помощью регулярных выражений определить есть ли в тексте подряд
более одной точки, при любом исходе сообщите результат пользователю!'''

import re

regex = r"\.{2,}"

matches = re.finditer(regex, some_str, re.MULTILINE)
if matches is None:
    print('В тексте нет более одной точки подряд')
else:
    print(
        f'В тексте есть более одной точки подряд ({sum(1 for _ in matches)}).'
    )
